from command import Command



commands = [
    Command(
        r'С кем дружит (\w+)\?',
        "С кем дружит *имя*?",
        "mutual_friends('{0}', X)"
    ),
    Command(
        r'Вооружен ли (\w+)\?',
        "Вооружен ли *имя*?",
        "armed('{0}')"
    ),
    Command(
        r'Что есть у (\w+)\?',
        "Что есть у *имя*?",
        "owns('{0}', What)"
    ),
    Command(
        r'Где находится (\w+)\?',
        "Где находится *имя/вещь",
        "location('{0}', X)"
    ),
    Command(
        r'В опасности ли (\w+)\?',
        "В опасности ли *имя*?",
        "in_danger('{0}')"
    ),
    Command(
        r'Подружатся ли (\w+)\sи\s(\w+)\?',
        "Подружатся ли *имя1* и *имя2*?",
        "enemy_of_my_enemy_is_friend('{0}', '{1}')"
    ),
    Command(
        r'Друзья ли (\w+)\sи\s(\w+)\?',
        "Друзья ли *имя1* и *имя2*?",
        "friend('{0}', '{1}')"
    )
]
