**Задание**

Название: полином Лагранжа с использованием полиномов Чебышёва

Описание: [ДИСКЛЕЙМЕР: Это не всё, что вам нужно сделать для сдачи лабораторной работы по курсу, но этого достаточно, чтобы получить вариант на следующую работу. Проверьте требования и вариант в методическом пособии в файлах Teams.]

Дан набор точек, по которым необходимо построить интерполяционный полином Лагранжа с использованием полиномов Чебышёва. Также задана координата x, для которой необходимо найти значение интерполяционного полинома.

Формат входных данных:
x1 x2 x3 ...
y1 y2 y3 ...
x

где x1...xn - список значений аргумента для узлов интерполяции, y1...yn - список значений функции для соответствующего значения аргумента для узлов интерполяции, x - значение аргумента, для которого требуется найти значение интерполяционного полинома. В тестах также вначале задаётся количество узлов интерполяции, однако, в функцию этот параметр не передаётся.

Формат выходных значений: вещественное число, являющееся значением интерполяционного полинома в точке x.

Доступные библиотеки:
```python
import math
import os
import random
import re
import sys
```

Код для редактирования:
```python
#
# Complete the 'interpolate_by_lagrange' function below.
#
# The function is expected to return a DOUBLE.
# The function accepts following parameters:
#  1. DOUBLE_ARRAY x_axis
#  2. DOUBLE_ARRAY y_axis
#  3. DOUBLE x
#

def interpolate_by_lagrange(x_axis, y_axis, x):
    return 0
```

Код после:
```python
if __name__ == '__main__':
    axis_count = int(input().strip())

    x_axis = list(map(float, input().rstrip().split()))

    y_axis = list(map(float, input().rstrip().split()))

    x = float(input().strip())

    result = interpolate_by_lagrange(x_axis, y_axis, x)

    print(str(result) + '\n')
```
